greatGinta/MCC_Melody_for_PIC16_Touch_Library/touch.X/mcc_generated_files/touch/mtouch_sensor.c
/*
 * =======================================================================
 *  Callback Function Pointers
 * =======================================================================
 */
static void (*callback_sampled)(enum mtouch_sensor_names sensor) = Sensor_DefaultCallback;

/*
 * =======================================================================
 *  Local Variables
 * =======================================================================
 */
static mtouch_sensor_packetsample_t     sensor_medianBuffer[MTOUCH_SENSORS][3];
static mtouch_sensor_packetsample_t     packet_sample[MTOUCH_SENSORS];
static enum mtouch_sensor_names         currentScanSensor = 0;
static bool                             sampling_flag = false;
static volatile bool                    scanInterrupted = false;
static bool                             lowpowerActivated = false;

/*
 * =======================================================================
 *  External Variables
 * =======================================================================
 */

/*
 * =======================================================================
 *  Sensor runtime data
 * =======================================================================
 */
static uint8_t                          freq_index = 0;
static uint8_t                          freq_hop[3] = {FRQ_0,FRQ_1,FRQ_2};
static mtouch_sensor_delay_t            sample_delay = FRQ_0;    

/*
 * =======================================================================
 *  Sensor Configurations
 * =======================================================================
 */
const mtouch_sensor_t mtouch_sensor_init[MTOUCH_SENSORS] = {
    {   Sensor_ANB7,
        MTOUCH_SENSOR_ADPCH_Sensor_ANB7,
        DELAY_CYCLE(MTOUCH_SENSOR_PRECHARGE_Sensor_ANB7),
        DELAY_CYCLE(MTOUCH_SENSOR_ACQUISITION_Sensor_ANB7),
        MTOUCH_SENSOR_OVERSAMPLING_Sensor_ANB7,
        MTOUCH_SENSOR_ADDITIONALCAP_Sensor_ANB7,
        0,0,0,0,0,0
    },
};

static mtouch_sensor_t mtouch_sensor[MTOUCH_SENSORS];

/*
 * =======================================================================
 * MTOUCH_Sensor_Init()
 * =======================================================================
 */
enum mtouch_sensor_error MTOUCH_Sensor_Initialize(enum mtouch_sensor_names sensor)
{
    MTOUCH_Sensor_Enable(sensor);
    MTOUCH_Sensor_Calibrate(sensor);
    Sensor_Sampled_Reset(&mtouch_sensor[sensor]);
    
    return MTOUCH_SENSOR_ERROR_none;
}

static void Sensor_SetTrisBit(enum mtouch_sensor_names sensor,uint8_t TrisBit)
{
    switch(sensor)
    {   
        case 0:  
            TRISBbits.TRISB7 = TrisBit;
            break; 
        
        default: break;
    }
}

/*
 * =======================================================================
 * MTOUCH_Sensor_ADCC_Initilaize
 * =======================================================================
 *  initialization for ADCC for CVD mode
 */
void MTOUCH_Sensor_ADCC_Initialize(void)
{
    
    // ADCCS  
    ADCLK = 0xf;
    // ADNREF VSS; ADPREF VDD;
    ADREF = 0x00;
    // ADCAP 0; 
    ADCAP = 0x00;
    // ADLTHL 0; 
    ADLTHL = 0x00;
    // ADLTHH 0; 
    ADLTHH = 0x00;
    // ADUTHL 0; 
    ADUTHL = 0x00;
    // ADUTHH 0; 
    ADUTHH = 0x00;
    // ADSTPTL 0; 
    ADSTPTL = 0x00;
    // ADSTPTH 0; 
    ADSTPTH = 0x00;
    
    // ADDSEN enabled; ADGPOL digital_low; ADIPEN enabled; ADPPOL VSS; 
    ADCON1 = 0x41;
    // ADCRS 0; ADMD Average Burst mode; ADACLR enabled; ADPSIS ADRES; Result right-shifted by 2bit in ADFLTR
    ADCON2 = 0xAB;

    // ADCALC First derivative of Single measurement; ADTMD enabled; ADSOI ADGO is cleared until ADTIF is triggered 
    ADCON3 = 0x0F;

    // ADGO stop; ADFM right; ADON enabled; ADCONT Enabled; ADCS FOSC/ADCLK; 
    ADCON0 = 0xC4;
   
    // Clear the ADC Threshold interrupt flag
    PIR1bits.ADTIF = 0;
    // Enabling ADCC threshold interrupt.
    PIE1bits.ADTIE = 1; 
    
    ADC_ThresholdCallbackRegister(ADCC_ThresholdISR_mTouch);
    
}


void MTOUCH_Sensor_InitializeAll(void)
{
    enum mtouch_sensor_names sensor; 
    
    memcpy(mtouch_sensor,mtouch_sensor_init,sizeof(mtouch_sensor_init));
    
    for (sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        MTOUCH_Sensor_Initialize(sensor);
    }
}


bool MTOUCH_Sensor_isSamplingComplete(void)
{
    enum mtouch_sensor_names sensor;   
    
    for (sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        if(MTOUCH_Sensor_wasSampled(sensor)==false && MTOUCH_Sensor_isEnabled(sensor))
        {   
            if(MTOUCH_Sensor_isSampling() == false)
            {
                Sensor_scheduleNextScan();
            }
            return false;
        }
    }
    
    return true;
}


bool MTOUCH_Sensor_SampleAll(void)
{
    if(MTOUCH_Sensor_isSamplingComplete() == false)
    {
        return false;
    }
    
    
    Sensor_FrequencyHopping();
    MTOUCH_Sensor_postAcquisitionProcess();
    
    return true;
}

bool MTOUCH_Sensor_isAnySensorActive(void)
{
    enum mtouch_sensor_names sensor;   
    
    for (sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        if(mtouch_sensor[sensor].active)
            return true;
    }
    
    return false;
}


void MTOUCH_Sensor_startLowpower(void)
{
    lowpowerActivated = true;
}

void MTOUCH_Sensor_exitLowpower(void)
{
    lowpowerActivated = false;
}

/*
 * =======================================================================
 * MTOUCH_Sensor_Scan_Initialize
 * =======================================================================
 *  initialization for ADC and pin module for guard/Tx
 */
void MTOUCH_Sensor_Scan_Initialize(void)
{
    MTOUCH_Sensor_ADCC_Initialize();
    
}

    
/*
 * =======================================================================
 * Sensor_scheduleNextScan()
 * =======================================================================
 */
static void Sensor_scheduleNextScan(void)
{
    mtouch_sensor_t* sensor;
    bool skipScan = (bool)false;
    bool state = (bool)GIE;
    
    
    while(MTOUCH_Sensor_wasSampled(currentScanSensor) || !MTOUCH_Sensor_isEnabled(currentScanSensor))
    {
        if(++currentScanSensor == MTOUCH_SENSORS)
        {
            currentScanSensor = 0;
            sampling_flag = false;
            skipScan = true;                    /* finished one round of sensor scan */
            break;
        }
    }
    
    
    if(skipScan==false)
    {
        sensor = &mtouch_sensor[currentScanSensor];
        if(Sensor_isCalibrated(sensor))
        {
            ADACQ = (mtouch_sensor_time_t)sensor->acquisition_time;
            ADPRE = (mtouch_sensor_time_t)sensor->precharge_time;
        }
        else
        {
            if(Sensor_isCalibratingAcqTime(sensor))
            {
                ADPRE = (mtouch_sensor_time_t)sensor->precharge_time;
                ADACQ = (mtouch_sensor_time_t)sensor->acquisition_time;
            }
            else
            {
                ADPRE = MAX_PRECHARGE_TIME;
                ADACQ = MAX_ACQ_TIME;
            }
        }

        ADPRE +=(uint8_t)sample_delay;           /* apply additional delay for freq hopping */
        ADPCH = (uint8_t)sensor->adpch;
        ADRPT = (uint8_t)(sensor->oversampling>>1);
        ADCAP = (uint8_t)sensor->addcap;
        ADCON0bits.ADON = 1;
        sampling_flag= true;
        Sensor_SetTrisBit(currentScanSensor,1);
        GIE = 0;
        ADCON0bits.GO = 1;
        ADACC = ((uint32_t)Sensor_calculate_balance_point(sensor->oversampling))<<2; /* scale up as the ADC is 12bit */
        GIE = state;
        scanInterrupted = false;
    }
}

