greatGinta/MCC_Melody_for_PIC16_Touch_Library/touch.X/mcc_generated_files/touch/mtouch_sensor.c
/*
 * 
 *=======================================================================
 * Automatic Sensor Calibration for internal capacitor and acquisition time
 *=======================================================================
 *
 */
static enum mtouch_sensor_error Sensor_autoCalibration(mtouch_sensor_t* sensor)
{
    enum mtouch_sensor_names name = sensor->sensor_name;
 
    /* Calibrating internal capacitor */
    if(!Sensor_isCalibratingAcqTime(sensor))                   
    {
        if(ADFLTR > Sensor_calculate_balance_point(sensor->oversampling))
        {
            if(++(sensor->addcap) >= ADD_CAP_LIMIT)
                Sensor_setCalibratAcqTime(sensor);
        }
        else
        {
             Sensor_setCalibratAcqTime(sensor);
        }
    }
    else                        
    /* Calibrating acquisition time */
    {
        if((mtouch_sensor_packetsample_t)abs(packet_sample[name] - ADFLTR) < Sensor_calculate_cal_thrs(sensor->oversampling))
        {
            sensor->precharge_time = MAX_PRECHARGE_TIME;
            Sensor_setCalibrated(sensor);
        }
        else
        {
            if((sensor->acquisition_time) >= (mtouch_sensor_time_t)(MAX_ACQ_TIME - DELAY_CYCLE(2)))
            {
                sensor->precharge_time = MAX_PRECHARGE_TIME;
                Sensor_setCalibrated(sensor);
            }
            else
            {
                /* Using Increment of 2 to ensure enough margin when
                   finger is touching the sensor */
                sensor->acquisition_time += DELAY_CYCLE(2); 
            }
        }    
    }
    
    return MTOUCH_SENSOR_ERROR_none;
}

/*
 * =======================================================================
 * MTOUCH_Sensor_postAcquisitionProcess()
 * =======================================================================
 * 
 */
void MTOUCH_Sensor_postAcquisitionProcess(void)
{
    enum mtouch_sensor_names name;
    
    for (name = 0; name < MTOUCH_SENSORS; name++)
    {
        if(mtouch_sensor[name].sampled)
        {     
            Sensor_RawSample_Update(&mtouch_sensor[name]);
            callback_sampled(name);
        }
    }
}

void MTOUCH_Sensor_ScanInterruptNotify(void)
{
    scanInterrupted = true;
}


void ADCC_ThresholdISR_mTouch(void)
{
    // Clear the ADC Threshold interrupt flag
    PIR1bits.ADTIF = 0; 
    MTOUCH_Sensor_Service();
}

/*
 * =======================================================================
 * MTOUCH_Sensor_Service()
 * =======================================================================
 * This function is a callback of ADACC ADTIF interrupt service
 */
static inline void MTOUCH_Sensor_Service(void)
{
    mtouch_sensor_t* sensor;
    
    Sensor_SetTrisBit(currentScanSensor,0);
    
    if(scanInterrupted)
    {
        ADCON0bits.ADON = 0;
    }
    else
    {                  
        ADCON0bits.ADON = 0;
        sensor = &mtouch_sensor[currentScanSensor];
        if(!Sensor_isCalibrated(sensor))
        {
            /* Skip sensor autocalibration based on MCC configuration */
            Sensor_setCalibrated(sensor);                                                                      
        }
        else
        {
            Sensor_setSampled(sensor); 
        }

        if((mtouch_sensor_packetsample_t)
                abs(packet_sample[currentScanSensor] - ADFLTR) > 
                MTOUCH_SENSOR_ACTIVE_THRESHOLD)
        {
            mtouch_sensor[currentScanSensor].active = true;
        }
        else
        {
            mtouch_sensor[currentScanSensor].active = false;
        }
        
        /* Stop update the packet_sample in low power mode, so that the current 
           sensor reading will compare with the last sensor reading in normal 
           power mode.
        */    
        
        if(!lowpowerActivated)    
            packet_sample[currentScanSensor] = ADFLTR;                               
    }
    
    if(lowpowerActivated == 1u)
    {
        sampling_flag = false; 
    }
    else
    {
        Sensor_scheduleNextScan(); 
    }    
}
/*
 * =======================================================================
 * Sensor_setSamplePeriod()
 * =======================================================================
 * This function rotates the sensor scan frequency from the frequency pool 
 */
static void Sensor_setSamplePeriod(void)
{
    if(++freq_index >= sizeof(freq_hop) )
        freq_index = 0;    

    sample_delay = freq_hop[freq_index];     
}
/*
 * =======================================================================
 * Sensor Raw Sample
 * =======================================================================
 */ 
mtouch_sensor_sample_t MTOUCH_Sensor_RawSample_Get(enum mtouch_sensor_names name) /* Global */
{
    if (name < MTOUCH_SENSORS)
    {
        return mtouch_sensor[name].rawSample;
    }
    else
        return (mtouch_sensor_sample_t)0;
}

mtouch_sensor_sample_t MTOUCH_Sensor_CVDSample_Get(enum mtouch_sensor_names name) /* Global */
{
    if (name < MTOUCH_SENSORS)
    {
        return packet_sample[name];
    }
    else
        return (mtouch_sensor_sample_t)0;
}
static void Sensor_RawSample_Update(mtouch_sensor_t* sensor) /* Local */
{
    mtouch_sensor_sample_t result = medianFilter(sensor->sensor_name);
    
    if (GIE == (uint8_t)1)
    {
        GIE = (uint8_t)0;
        sensor->rawSample = result;
        GIE = (uint8_t)1;
    }
    else
    {
        sensor->rawSample = result;
    }
}


static mtouch_sensor_packetsample_t medianFilter(enum mtouch_sensor_names sensor)
{
    static uint8_t bufferIndex[MTOUCH_SENSORS];
    
    sensor_medianBuffer[sensor][bufferIndex[sensor]++] = packet_sample[sensor];
    
    if(bufferIndex[sensor]>=3)
        bufferIndex[sensor] = 0;
    
    if(sensor_medianBuffer[sensor][0]>=sensor_medianBuffer[sensor][1])
    {
        if(sensor_medianBuffer[sensor][1]>=sensor_medianBuffer[sensor][2])
            return sensor_medianBuffer[sensor][1];
        else
        {   
            if(sensor_medianBuffer[sensor][0]>=sensor_medianBuffer[sensor][2])
                return sensor_medianBuffer[sensor][2];
            else
                return sensor_medianBuffer[sensor][0];
        }
            
